"""
Задача2. Пользователь вводит время в секундах.
Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
Используйте форматирование строк.
Решение:
"""
print('Перевод времени в чч:мм:сс')

time = int(input('Введите время в секундах: '))

seconds = time % 60
minutes = time // 60
hours = minutes // 60

print(f'{hours}:{minutes}:{seconds}')  
#print(f'{hours:02}:{minutes:02}:{seconds:02}')  # добивание 2х знаков (в случае необходимости - нолями)
